Documents/ПроведённоеЗанятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПроведённоеЗанятие</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЧасыПоДис</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоПрисутствующих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчебныеМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Расписание</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Группы</Name>
					<Comment>Перечисление групп на паре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Семестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДеньНедели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗанятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗанятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аудитория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аудитория</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплина</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЧасыПоДис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЧасыПоДис</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Comment>Суммарное время проведения занятий в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплина</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Семестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПроведённоеЗанятие/Ext/ObjectModule.bsl
Функция ПолучитьЧислоСтудентовГрупп(Группы)
	ВсегоСтудентов = 0;	
	Для каждого Группа из Группы Цикл
		ВсегоСтудентов = ВсегоСтудентов + 
			Справочники
				.Группа
				.НайтиПоНаименованию(Группа)
				.КоличествоСтудентов;
	КонецЦикла;		
	Возврат ВсегоСтудентов;	
КонецФункции 

Функция ПолучитьГруппуПоНаименованию(Группа) 
	Возврат Справочники
				.Группа
				.НайтиПоНаименованию(Группа)
				.Ссылка;
КонецФункции

Функция НайтиРасписаниеПоКоду(Код, Поле)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 " + Поле + " 
	|	КАК Значение
	|ИЗ РегистрСведений.Расписание
	|ГДЕ Код = &Код
	|");
	Запрос.УстановитьПараметр("Код", Код); 
	Результат = Запрос.Выполнить().Выгрузить();  
	Возврат Результат[0].Значение;      
КонецФункции

Процедура ПередЗаписью(Отказ) 
	Группы = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Группы");
	МаксимумСтудентов = ПолучитьЧислоСтудентовГрупп(СтрРазделить(Группы, " "));
	Если ЭтотОбъект.КолвоПрисутствующих > МаксимумСтудентов Тогда
		ТекстСообщения = "Количество присутствующих превышает сумму студентов по группам! 
		| Максимальное значение - " + МаксимумСтудентов;
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)
	Дисциплина = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Дисциплина");
	Семестр = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Семестр");
    Группы = НайтиРасписаниеПоКоду(ЭтотОбъект.Расписание, "Группы");
	
	Движения.ЧасыПоДис.Записывать = Истина;
	Для каждого Группа из СтрРазделить(Группы, " ", Ложь) Цикл
		Движение = Движения.ЧасыПоДис.Добавить();
		Движение.Период = Дата;
		Движение.Дисциплина = Дисциплина;
		Движение.Группа = ПолучитьГруппуПоНаименованию(Группа); 
		Движение.Семестр = Семестр;
		Движение.Время = ЭтотОбъект.Длительность;
	КонецЦикла;   
КонецПроцедуры
